package com.srizwan01.nirvoy11;

import android.content.Intent;
import android.graphics.*;
import android.graphics.Typeface;
import android.os.*;
import android.os.Bundle;
import android.util.*;
import android.view.*;
import android.view.View;
import android.widget.*;
import android.widget.BaseAdapter;
import android.widget.ImageView;
import android.widget.LinearLayout;
import android.widget.ListView;
import android.widget.TextView;

import androidx.appcompat.app.AppCompatActivity;

import com.google.firebase.FirebaseApp;

import java.util.*;
import java.util.ArrayList;
import java.util.HashMap;

public class PolicephonebookActivity extends AppCompatActivity {
	
	private HashMap<String, Object> map = new HashMap<>();
	
	private ArrayList<HashMap<String, Object>> list = new ArrayList<>();
	
	private LinearLayout linear1;
	private LinearLayout linear2;
	private ListView listview1;
	private ImageView imageview1;
	private TextView textview1;
	
	private Intent in = new Intent();
	
	@Override
	protected void onCreate(Bundle _savedInstanceState) {
		super.onCreate(_savedInstanceState);
		setContentView(R.layout.policephonebook);
		initialize(_savedInstanceState);
		FirebaseApp.initializeApp(this);
		initializeLogic();
	}
	
	private void initialize(Bundle _savedInstanceState) {
		linear1 = findViewById(R.id.linear1);
		linear2 = findViewById(R.id.linear2);
		listview1 = findViewById(R.id.listview1);
		imageview1 = findViewById(R.id.imageview1);
		textview1 = findViewById(R.id.textview1);
		
		imageview1.setOnClickListener(new View.OnClickListener() {
			@Override
			public void onClick(View _view) {
				finish();
			}
		});
	}
	
	private void initializeLogic() {
		textview1.setTypeface(Typeface.createFromAsset(getAssets(),"fonts/solaimanlipi.ttf"), 0);
		{
			android.graphics.drawable.GradientDrawable SketchUi = new android.graphics.drawable.GradientDrawable();
			int d = (int) getApplicationContext().getResources().getDisplayMetrics().density;
			SketchUi.setColor(0xFF4CAF50);
			linear2.setElevation(d*7);
			linear2.setBackground(SketchUi);
		}
		_statusbarcolor("#FF4CAF50");
		_contentlist("ডিএমপি, ঢাকা", "\n ১। ওসি রমনা- ০১৭১৩৩৭৩১২৫\n\n ২। ওসি ধানমন্ডি- ০১৭১৩৩৭৩১২৬\n\n ৩। ওসি শাহাবাগ- ০১৭১৩৩৭৩১২৭\n\n ৪। ওসি নিউ মার্কেট- ০১৭১৩৩৭৩১২৮\n\n ৫। ওসি লালবাগ- ০১৭১৩৩৭৩১৩৪\n\n ৬। ওসি কোতয়ালী- ০১৭১৩৩৭৩১৩৫\n\n ৭। ওসি হাজারীবাগ- ০১৭১৩৩৭৩১৩৬\n\n ৮। ওসি কামরাঙ্গীরচর- ০১৭১৩৩৭৩১৩৭\n\n ৯। ওসি সুত্রাপুর- ০১৭১৩৩৭৩১৪৩\n\n ১০। ওসি ডেমরা- ০১৭১৩৩৭৩১৪৪\n\n ১১। ওসি শ্যামপুর- ০১৭১৩৩৭৩১৪৫\n\n ১২। ওসি যাত্রাবাড়ী- ০১৭১৩৩৭৩১৪৬\n\n ১৩। ওসি মতিঝিল- ০১৭১৩৩৭৩১৫২\n\n ১৪। ওসি সবুজবাগ- ০১৭১৩৩৭৩১৫৩\n\n ১৫। ওসি খিলগাও- ০১৭১৩৩৭৩১৫৪\n\n ১৬। ওসি পল্টন- ০১৭১৩৩৭৩১৫৫\n\n ১৭। ওসি উত্তরা- ০১৭১৩৩৭৩১৬১\n\n ১৮। ওসি এয়ারপোর্ট- ০১৭১৩৩৭৩১৬২\n\n ১৯। ওসি তুরাগ- ০১৭১৩৩৭৩১৬৩\n\n ২০। ওসি উত্তরখান- ০১৭১৩৩৭৩১৬৪\n\n ২১। ওসি দক্ষিনখান- ০১৭১৩৩৭৩১৬৫\n\n ২২। ওসি গুলশান- ০১৭১৩৩৭৩১৭১\n\n ২৩। ওসি ক্যান্টনমেন্ট- ০১৭১৩৩৭৩১৭২\n\n ২৪। ওসি বাড্ডা- ০১৭১৩৩৭৩১৭৩\n\n ২৫। ওসি খিলক্ষেত- ০১৭১৩৩৭৩১৭৪\n\n ২৬। ওসি তেজগাও- ০১৭১৩৩৭৩১৮০\n\n ২৭। ওসি তেজগাও শি/এ- ০১৭১৩৩৭৩১৮১\n\n ২৮। ওসি মোহাম্মদপুর- ০১৭১৩৩৭৩১৮২\n\n ২৯। ওসি আদাবর- ০১৭১৩৩৭৩১৮৩\n\n ৩০। ওসি মিরপুর- ০১৭১৩৩৭৩১৮৯\n\n ৩১। ওসি পল্লবী- ০১৭১৩৩৭৩১৯০\n\n ৩২। ওসি কাফরুল- ০১৭১৩৩৭৩১৯১\n\n ৩৩। ওসি শাহ আলী- ০১৭১৩৩৭৩১৯২");
		_contentlist("সিএমপি, চট্রগ্রাম", "১। ওসি কোতয়ালী, সিএমপি- ০১৭১৩৩৭৩২৫৬\n\n ২। ওসি পাহাড়তলী (নর্থ জোন)- ০১৭১৩৩৭৩২৫৭\n\n ৩। ওসি পাচলাইশ- ০১৭১৩৩৭৩২৫৮\n\n ৪। ওসি চান্দগাও- ০১৭১৩৩৭৩২৫৯\n\n ৫। ওসি খুলসী- ০১৭১৩৩৭৩২৬০\n\n ৬। ওসি বাকুলিয়া- ০১৭১৩৩৭৩২৬১\n\n ৭। ওসি ওসি বায়েজিদ বোস্তামী- ০১৭১৩৩৭৩২৬২\n\n ৮। ওসি বন্দর- ০১৭১৩৩৭৩২৬৭\n\n ৯। ওসি ডাবল মুরিং- ০১৭১৩৩৭৩২৬৮\n\n ১০। ওসি হালিশহর- ০১৭১৩৩৭৩২৬৯\n\n ১১। ওসি পতেঙ্গা- ০১৭১৩৩৭৩২৭০\n\n ১২। ওসি কর্ণফুলি- ০১৭১৩৩৭৩২৭১\n\n ১৩। ওসি ইমিগ্রেশন (বন্দর)- ০১৭১৩৩৭৩২৭২\n\n ১৪। ওসি পাহাড়তলী (বন্দর জোন)- ০১৭১৩৩৭৩২৭৩");
		_contentlist("কেএমপি, খুলনা", "\n ১। ওসি খুলনা- ০১৭১৩৩৭৩২৮৫\n\n ২। ওসি সোনাডাঙ্গা- ০১৭১৩৩৭৩২৮৬\n\n ৩। ওসি খালিশপুর- ০১৭১৩৩৭৩২৮৭\n\n ৪। ওসি দৌলতপুর- ০১৭১৩৩৭৩২৮৮\n\n ৫। ওসি খানজাহান আলী- ০১৭১৩৩৭৩২৮৯");
		_contentlist("আরএমপি, রাজশাহী", "\n ১। ওসি বোয়ালিয়া- ০১৭১৩৩৭৩৩০৯\n\n ২। ওসি রাজপাড়া- ০১৭১৩৩৭৩৩১০\n\n ৩। ওসি মতিহার- ০১৭১৩৩৭৩৩১১\n\n ৪। ওসি শাহ মাকদুম- ০১৭১৩৩৭৩৩১২");
		_contentlist("ঢাকা বিভাগ", "\n ১। ওসি সাভার- ০১৭১৩৩৭৩৩২৭\n\n ২। ওসি ধামরাই- ০১৭১৩৩৭৩৩২৮\n\n ৩। ওসি কেরানীগঞ্জ- ০১৭১৩৩৭৩৩২৯\n\n ৪। ওসি নবাবগঞ্জ- ০১৭১৩৩৭৩৩৩০\n\n ৫। ওসি দোহার- ০১৭১৩৩৭৩৩৩১\n\n ৬। ওসি আশুলিয়া- ০১৭১৩৩৭৩৩৩২\n\n ৭। ওসি দক্ষিন কেরানীগঞ্জ- ০১৭১৩৩৭৩৩৩৩\n\n ৮। ওসি নারায়নগঞ্জ- ০১৭১৩৩৭৩৩৪৫\n\n ৯। ওসি ফতুল্লা- ০১৭১৩৩৭৩৩৪৬\n\n ১০। ওসি বন্দর- ০১৭১৩৩৭৩৩৪৭\n\n ১১। ওসি সিদ্দিরগঞ্জ- ০১৭১৩৩৭৩৩৪৮\n\n ১২। ওসি আড়াইহাজার- ০১৭১৩৩৭৩৩৪৯\n\n ১৩। ওসি সোনারগাও- ০১৭১৩৩৭৩৩৫০\n\n ১৪। ওসি রুপগঞ্জ- ০১৭১৩৩৭৩৩৫১\n\n ১৫। ওসি জয়দেবপুর ০১৭১৩৩৭৩৩৬৩\n\n ১৬। ওসি টংগী- ০১৭১৩৩৭৩৩৬৪\n\n ১৭। ওসি কালিয়াকৈর- ০১৭১৩৩৭৩৩৬৫\n\n ১৮। ওসি শ্রীপুর- ০১৭১৩৩৭৩৩৬৬\n\n ১৯। ওসি কাপাসিয়া- ০১৭১৩৩৭৩৩৬৭\n\n ২০। ওসি কালিগঞ্জ- ০১৭১৩৩৭৩৩৬৮\n\n ২১। ওসি মানিকগঞ্জ- ০১৭১৩৩৭৩৩৭৯\n\n ২২। ওসি ঘিওর- ০১৭১৩৩৭৩৩৮০\n\n ২৩। ওসি শিবালয়- ০১৭১৩৩৭৩৩৮১\n\n ২৪। ওসি দৌলতপুর- ০১৭১৩৩৭৩৩৮২\n\n ২৫। ওসি হরিরামপুর- ০১৭১৩৩৭৩৩৮৩\n\n ২৬। ওসি সাটুরিয়া- ০১৭১৩৩৭৩৩৮৪\n\n ২৭। ওসি সিংগাইর- ০১৭১৩৩৭৩৩৮৫\n\n ২৮। ওসি মুন্সীগঞ্জ- ০১৭১৩৩৭৩৩৯৬\n\n ২৯। ওসি টংগীবাড়ী- ০১৭১৩৩৭৩৩৯৭\n\n ৩০। ওসি লৌহজং- ০১৭১৩৩৭৩৩৯৮\n\n ৩১। ওসি শ্রীনগর- ০১৭১৩৩৭৩৩৯৯\n\n ৩২। ওসি সিরাজদীখান- ০১৭১৩৩৭৩৪০০\n\n ৩৩। ওসি গজারিয়া- ০১৭১৩৩৭৩৪০১\n\n ৩৪। ওসি নরসিংদী- ০১৭১৩৩৭৩৪১২\n\n ৩৫। ওসি রায়পুর- ০১৭১৩৩৭৩৪১৩\n\n ৩৬। ওসি শিবপুর- ০১৭১৩৩৭৩৪১৪\n\n ৩৭। ওসি বেলাবো- ০১৭১৩৩৭৩৪১৫\n\n ৩৮। ওসি মনোহরদী- ০১৭১৩৩৭৩৪১৬\n\n ৩৯। ওসি পলাশ- ০১৭১৩৩৭৩৪১৭\n\n ৪০। ওসি কোতয়ালী মযমনসিংহ- ০১৭১৩৩৭৩৪৩০\n\n ৪১। ওসি মুক্তাগাছা- ০১৭১৩৩৭৩৪৩১\n\n ৪২। ওসি ফুলবাড়ী- ০১৭১৩৩৭৩৪৩২\n\n ৪৩। ওসি ত্রিশাল- ০১৭১৩৩৭৩৪৩৩\n\n ৪৪। ওসি গৌরীপুর- ০১৭১৩৩৭৩৪৩৪\n\n ৪৫। ওসি ঈশ্বরগঞ্জ- ০১৭১৩৩৭৩৪৩৫\n\n ৪৬। ওসি নান্দাইল- ০১৭১৩৩৭৩৪৩৬\n\n ৪৭। ওসি ফুলপুর- ০১৭১৩৩৭৩৪৩৭\n\n ৪৮। ওসি হালুয়াঘাট- ০১৭১৩৩৭৩৪৩৮\n\n ৪৯। ওসি ধোবাউরা- ০১৭১৩৩৭৩৪৩৯\n\n ৫০। ওসি গফরগাও- ০১৭১৩৩৭৩৪৪০\n\n ৫১। ওসি ভালুকা- ০১৭১৩৩৭৩৪৪১\n\n ৫২। ওসি তারাকান্দা- ০১৭১৩৩৭৩৪৪২\n\n ৫৩। ওসি টাঙ্গাইল- ০১৭১৩৩৭৩৪৫৪\n\n ৫৪। ওসি মির্জাপুর- ০১৭১৩৩৭৩৪৫৫\n\n ৫৫। ওসি নাগরপুর- ০১৭১৩৩৭৩৪৫৬\n\n ৫৬। ওসি সখিপুর- ০১৭১৩৩৭৩৪৫৭\n\n ৫৭। ওসি বাসাইল- ০১৭১৩৩৭৩৪৫৮\n\n ৫৮। ওসি দেলদুয়ার- ০১৭১৩৩৭৩৪৫৯\n\n ৫৯। ওসি মধুপুর- ০১৭১৩৩৭৩৪৬০\n\n ৬০। ওসি ঘাটাইল- ০১৭১৩৩৭৩৪৬১\n\n ৬১। ওসি কালিহাতি- ০১৭১৩৩৭৩৪৬২\n\n ৬২। ওসি ভুয়াপুর- ০১৭১৩৩৭৩৪৬৩\n\n ৬৩। ওসি ওসি যমুনা ব্রীজ পূর্ব- ০১৭১৩৩৭৩৪৬৪\n\n ৬৪। ওসি ধনবাড়ী- ০১৭১৩৩৭৩৪৬৫\n\n ৬৫। ওসি গোপালপুর- ০১৭১৩৩৭৩৪৬৬\n\n ৬৬। ওসি কিশোরগঞ্জ- ০১৭১৩৩৭৩৪৮০\n\n ৬৭। ওসি করিমগঞ্জ- ০১৭১৩৩৭৩৪৮১\n\n ৬৮। ওসি তারাইল- ০১৭১৩৩৭৩৪৮২\n\n ৬৯। ওসি হোসেনপুর- ০১৭১৩৩৭৩৪৮৩\n\n ৭০। ওসি কটিয়াদী- ০১৭১৩৩৭৩৪৮৪\n\n ৭১। ওসি বাজিতপুর- ০১৭১৩৩৭৩৪৮৫\n\n ৭২। ওসি কুলিয়ারচর- ০১৭১৩৩৭৩৪৮৬\n\n ৭৩। ওসি ভৈরব- ০১৭১৩৩৭৩৪৮৭\n\n ৭৪। ওসি ইটনা- ০১৭১৩৩৭৩৪৮৮\n\n ৭৫। ওসি মিঠামইন- ০১৭১৩৩৭৩৪৮৯\n\n ৭৬। ওসি নিকলী- ০১৭১৩৩৭৩৪৯০\n\n ৭৭। ওসি পাকুন্দিয়া- ০১৭১৩৩৭৩৪৯১\n\n ৭৮। ওসি অষ্টগ্রাম- ০১৭১৩৩৭৩৪৯২\n\n ৭৯। ওসি নেত্রকোনা- ০১৭১৩৩৭৩৫০৫\n\n ৮০। ওসি বারহাট্টা- ০১৭১৩৩৭৩৫০৬\n\n ৮১। ওসি কলমাকান্দা- ০১৭১৩৩৭৩৫০৭\n\n ৮২। ওসি আটপাড়া- ০১৭১৩৩৭৩৫০৮\n\n ৮৩। ওসি দুর্গাপুর- ০১৭১৩৩৭৩৫০৯\n\n ৮৪। ওসি পূর্বধলা- ০১৭১৩৩৭৩৫১০\n\n ৮৫। ওসি কেন্দুয়া- ০১৭১৩৩৭৩৫১১\n\n ৮৬। ওসি মদন- ০১৭১৩৩৭৩৫১২\n\n ৮৭। ওসি মোহনগঞ্জ- ০১৭১৩৩৭৩৫১৩\n\n ৮৮। ওসি খালিজুরি- ০১৭১৩৩৭৩৫১৪\n\n ৮৯। ওসি শেরপুর- ০১৭১৩৩৭৩৫২৩\n\n ৯০। ওসি নকলা- ০১৭১৩৩৭৩৫২৪\n\n ৯১। ওসি নলিতাবাড়ী- ০১৭১৩৩৭৩৫২৫\n\n ৯২। ওসি শ্রীবর্দী- ০১৭১৩৩৭৩৫২৬\n\n ৯৩। ওসি ঝিনাইগাতি- ০১৭১৩৩৭৩৫২৭\n\n ৯৪। ওসি জামালপুর- ০১৭১৩৩৭৩৫৩৮\n\n ৯৫। ওসি মেলান্দহ- ০১৭১৩৩৭৩৫৩৯\n\n ৯৬। ওসি সরিষাবাড়ী- ০১৭১৩৩৭৩৫৪০\n\n ৯৭। ওসি দেওয়ানগঞ্জ- ০১৭১৩৩৭৩৫৪১\n\n ৯৮। ওসি ইসলামপুর- ০১৭১৩৩৭৩৫৪২\n\n ৯৯। ওসি মাদারগঞ্জ- ০১৭১৩৩৭৩৫৪৩\n\n ১০০। ওসি বকশীগঞ্জ- ০১৭১৩৩৭৩৫৪৪\n\n ১০১। ওসি বাহাদুরাবাদ- ০১৭১৩৩৭৩৫৪৫\n\n ১০২। ওসি কোতয়ালী ফরিদপুর- ০১৭১৩৩৭৩৫৫৬\n\n ১০৩। ওসি মধুখালী- ০১৭১৩৩৭৩৫৫৭\n\n ১০৪। ওসি বোয়ালমারী- ০১৭১৩৩৭৩৫৫৮\n\n ১০৫। ওসি আলফাডাঙ্গা- ০১৭১৩৩৭৩৫৫৯\n\n ১০৬। ওসি চরভদ্রাসন- ০১৭১৩৩৭৩৫৬০\n\n ১০৭। ওসি নগরকান্দা- ০১৭১৩৩৭৩৫৬১\n\n ১০৮। ওসি সদরপুর- ০১৭১৩৩৭৩৫৬২\n\n ১০৯। ওসি সালতা- ০১৭১৩৩৭৩৫৬৩\n\n ১১০। ওসি ভাংগা- ০১৭১৩৩৭৩৫৬৪\n\n ১১১। ওসি গোপালগঞ্জ- ০১৭১৩৩৭৩৫৭২\n\n ১১২। ওসি মকসুদপুর- ০১৭১৩৩৭৩৫৭৩\n\n ১১৩। ওসি কাশিয়ানী- ০১৭১৩৩৭৩৫৭৪\n\n ১১৪। ওসি কোটালীপাড়া- ০১৭১৩৩৭৩৫৭৫\n\n ১১৫। ওসি টুঙ্গিপাড়া- ০১৭১৩৩৭৩৫৭৬\n\n ১১৬। ওসি মাদারীপুর- ০১৭১৩৩৭৩৫৮৫\n\n ১১৭। ওসি রাজৈর- ০১৭১৩৩৭৩৫৮৬\n\n ১১৮। ওসি কালকিনি- ০১৭১৩৩৭৩৫৮৭\n\n ১১৯। ওসি শিবচর- ০১৭১৩৩৭৩৫৮৮\n\n ১২০। ওসি রাজবাড়ী- ০১৭১৩৩৭৩৫৯৮\n\n ১২১। ওসি বালিয়াকান্দি- ০১৭১৩৩৭৩৫৯৯\n\n ১২২। ওসি পাংশা- ০১৭১৩৩৭৩৬০০\n\n ১২৩। ওসি গোয়ালন্দ- ০১৭১৩৩৭৩৬০১\n\n ১২৪। ওসি গোসাইরহাট- ০১৭১৩৩৭৩৬১২\n\n ১২৫। ওসি ভেদরগঞ্জ- ০১৭১৩৩৭৩৬১৩\n\n ১২৬। ওসি ডামুড্ডা- ০১৭১৩৩৭৩৬১৪\n\n ১২৭। ওসি জাজিরা- ০১৭১৩৩৭৩৬১৫\n\n ১২৮। ওসি নড়িয়া- ০১৭১৩৩৭৩৬১৬\n\n ১২৯। ওসি পালং- ০১৭১৩৩৭৩৬১৭\n\n ১৩০। ওসি শখিপুর- ০১৭১৩৩৭৩৬১৮");
		_contentlist("চট্রগ্রাম বিভাগ", "\n ১। ওসি রাউজান- ০১৭১৩৩৭৩৬৩৯\n\n ২। ওসি হাটহাজারী- ০১৭১৩৩৭৩৬৪০\n\n ৩। ওসি ফটিকছড়ি- ০১৭১৩৩৭৩৬৪১\n\n ৪। ওসি রাংগুনিয়া- ০১৭১৩৩৭৩৬৪২\n\n ৫। ওসি পটিয়া- ০১৭১৩৩৭৩৬৪৩\n\n ৬। ওসি মীরসরাই- ০১৭১৩৩৭৩৬৪৪\n\n ৭। ওসি সীতাকুন্ডু- ০১৭১৩৩৭৩৬৪৫\n\n ৮। ওসি আনোয়ারা- ০১৭১৩৩৭৩৬৪৬\n\n ৯। ওসি বোয়ালখালী- ০১৭১৩৩৭৩৬৪৭\n\n ১০। ওসি বাশখালী- ০১৭১৩৩৭৩৬৪৮\n\n ১১। ওসি সাতকানিয়া- ০১৭১৩৩৭৩৬৪৯\n\n ১২। ওসি লোহাগড়া- ০১৭১৩৩৭৩৬৫০\n\n ১৩। ওসি চান্দনাইশ- ০১৭১৩৩৭৩৬৫১\n\n ১৪। ওসি সন্দীপ- ০১৭১৩৩৭৩৬৫২\n\n ১৫। ওসি কক্সবাজার- ০১৭১৩৩৭৩৬৬৩\n\n ১৬। ওসি রামু- ০১৭১৩৩৭৩৬৬৪\n\n ১৭। ওসি উখিয়া- ০১৭১৩৩৭৩৬৬৫\n\n ১৮। ওসি টেকনাফ- ০১৭১৩৩৭৩৬৬৬\n\n ১৯। ওসি চকোরিয়া- ০১৭১৩৩৭৩৬৬৭\n\n ২০। ওসি কুতুবদিয়া- ০১৭১৩৩৭৩৬৬৮\n\n ২১। ওসি মহেষখালী- ০১৭১৩৩৭৩৬৬৯\n\n ২২। ওসি পেকুয়া- ০১৭১৩৩৭৩৬৭০\n\n ২৩। ওসি কোতয়ালী কুমিল্লা- ০১৭১৩৩৭৩৬৮৫\n\n ২৪। ওসি চৌদ্দগ্রাম- ০১৭১৩৩৭৩৬৮৬\n\n ২৫। ওসি দেবীদ্দার- ০১৭১৩৩৭৩৬৮৭\n\n ২৬। ওসি হোমনা- ০১৭১৩৩৭৩৬৮৮\n\n ২৭। ওসি লাকসাম- ০১৭১৩৩৭৩৬৮৯\n\n ২৮। ওসি দাউদকান্দি- ০১৭১৩৩৭৩৬৯০\n\n ২৯। ওসি বুড়িচং- ০১৭১৩৩৭৩৬৯১\n\n ৩০। ওসি চান্দিনা- ০১৭১৩৩৭৩৬৯২\n\n ৩২। ওসি বরুরা- ০১৭১৩৩৭৩৬৯৩\n\n ৩৩। ওসি লাঙ্গলকোট- ০১৭১৩৩৭৩৬৯৪\n\n ৩৪। ওসি মুরাদনগর- ০১৭১৩৩৭৩৬৯৫\n\n ৩৫। ওসি ব্রাক্ষ্মনপাড়া- ০১৭১৩৩৭৩৬৯৬\n\n ৩৬। ওসি মেঘনা- ০১৭১৩৩৭৩৬৯৭\n\n ৩৭। ওসি মনোহরগঞ্জ- ০১৭১৩৩৭৩৬৯৮\n\n ৩৮। ওসি তিতাস- ০১৭১৩৩৭৩৬৯৯\n\n ৩৯। ওসি সদর দক্ষিন কুমিল্লা- ০১৭১৩৩৭৩৭০০\n\n ৪০। ওসি চাদপুর- ০১৭১৩৩৭৩৭১২\n\n ৪১। ওসি হাজীগঞ্জ- ০১৭১৩৩৭৩৭১৩\n\n ৪২। ওসি মতলব- ০১৭১৩৩৭৩৭১৪\n\n ৪৩। ওসি মতলব উত্তর- ০১৭১৩৩৭৩৭১৪\n\n ৪৪। ওসি মতলব দক্ষিন- ০১৭১৩৩৭৩৭১৫\n\n ৪৫। ওসি শাহারাস্তি- ০১৭১৩৩৭৩৭১৬\n\n ৪৬। ওসি কচুয়া- ০১৭১৩৩৭৩৭১৭\n\n ৪৭। ওসি ফরিদগঞ্জ- ০১৭১৩৩৭৩৭১৮\n\n ৪৮। ওসি হাইমচর- ০১৭১৩৩৭৩৭১৯\n\n ৪৯। ওসি ব্রাক্ষ্মনবাড়ীয়া সদর- ০১৭১৩৩৭৩৭৩০\n\n ৫০। ওসি সরাইল- ০১৭১৩৩৭৩৭৩১\n\n ৫১। ওসি আশুগঞ্জ- ০১৭১৩৩৭৩৭৩২\n\n ৫২। ওসি নাসিরনগর- ০১৭১৩৩৭৩৭৩৩\n\n ৫৩। ওসি নবীনগর- ০১৭১৩৩৭৩৭৩৪\n\n ৫৪। ওসি বাঞ্ছারামপুর- ০১৭১৩৩৭৩৭৩৫\n\n ৫৫। ওসি কসবা- ০১৭১৩৩৭৩৭৩৬\n\n ৫৬। ওসি আখাউড়া- ০১৭১৩৩৭৩৭৩৭\n\n ৫৭। ওসি সুধারাম, নোয়াখালী- ০১৭১৩৩৭৩৭৪৮v ৫৮। ওসি বেগমগঞ্জ- ০১৭১৩৩৭৩৭৪৯\n\n ৫৯। ওসি সেনবাগ- ০১৭১৩৩৭৩৭৫০\n\n ৬০। ওসি সোনাইমুরি- ০১৭১৩৩৭৩৭৫১\n\n ৬১। ওসি কোম্পানীগঞ্জ- ০১৭১৩৩৭৩৭৫২\n\n ৬২। ওসি চাটখিল- ০১৭১৩৩৭৩৭৫৩\n\n ৬৩। ওসি হাতিয়া- ০১৭১৩৩৭৩৭৫৪\n\n ৬৪। ওসি চরজব্বার- ০১৭১৩৩৭৩৭৫৫\n\n ৬৫। ওসি লক্ষীপুর- ০১৭১৩৩৭৩৭৬৫\n\n ৬৬। ওসি রায়পুরা- ০১৭১৩৩৭৩৭৬৬\n\n ৬৭। ওসি রামগঞ্জ- ০১৭১৩৩৭৩৭৬৭\n\n ৬৮। ওসি রামগাতি- ০১৭১৩৩৭৩৭৬৮\n\n ৬৯। ওসি ফেনী- ০১৭১৩৩৭৩৭৭৮\n\n ৭০। ওসি সোনাগাজী- ০১৭১৩৩৭৩৭৭৯\n\n ৭১। ওসি ফুলগাজী- ০১৭১৩৩৭৩৭৮০\n\n ৭২। ওসি পরশুরাম- ০১৭১৩৩৭৩৭৮১\n\n ৭৩। ওসি ছাগলনাইয়া- ০১৭১৩৩৭৩৭৮২\n\n ৭৪। ওসি দাগনভুইয়া- ০১৭১৩৩৭৩৭৮৩");
		_contentlist("রাজশাহী বিভাগ", "\n ১। ওসি পবা- ০১৭১৩৩৭৩৮০০\n\n ২। ওসি গুদাগাড়ি- ০১৭১৩৩৭৩৮০১\n\n ৩। ওসি তানর- ০১৭১৩৩৭৩৮০২\n\n ৪। ওসি মোহনপুর- ০১৭১৩৩৭৩৮০৩\n\n ৫। ওসি পুঠিয়া- ০১৭১৩৩৭৩৮০৪\n\n ৬। ওসি বাগমারা- ০১৭১৩৩৭৩৮০৫\n\n ৭। ওসি দুর্গাপুর- ০১৭১৩৩৭৩৮০৬\n\n ৮। ওসি চারঘাট- ০১৭১৩৩৭৩৮০৭\n\n ৯। ওসি বাঘা- ০১৭১৩৩৭৩৮০৮\n\n ১০। ওসি চাপাই নবাবগঞ্জ- ০১৭১৩৩৭৩৮১৯\n\n ১১। ওসি শিবগঞ্জ- ০১৭১৩৩৭৩৮২০\n\n ১২। ওসি গোমস্তাপুর- ০১৭১৩৩৭৩৮২১\n\n ১৩। ওসি নাচোল- ০১৭১৩৩৭৩৮২২\n\n ১৪। ওসি ভোলাহাট- ০১৭১৩৩৭৩৮২৩\n\n ১৫। ওসি নওগা- ০১৭১৩৩৭৩৮৩৬\n\n ১৬। ওসি রায়নগর- ০১৭১৩৩৭৩৮৩৭\n\n ১৭। ওসি আত্রাই- ০১৭১৩৩৭৩৮৩৮\n\n ১৮। ওসি ধামরাই- ০১৭১৩৩৭৩৮৩৯\n\n ১৯। ওসি বাদলগাছি- ০১৭১৩৩৭৩৮৪০\n\n ২০। ওসি মহাদেবপুর- ০১৭১৩৩৭৩৮৪১\n\n ২১। ওসি পাটনীতলা- ০১৭১৩৩৭৩৮৪২\n\n ২২। ওসি নিয়ামতপুর- ০১৭১৩৩৭৩৮৪৩\n\n ২৩। ওসি মান্দা- ০১৭১৩৩৭৩৮৪৪\n\n ২৪। ওসি সাপাহার- ০১৭১৩৩৭৩৮৪৫\n\n ২৫। ওসি পর্শা- ০১৭১৩৩৭৩৮৪৬\n\n ২৬। ওসি নাটোর- ০১৭১৩৩৭৩৮৫৭\n\n ২৭। ওসি সিংড়া- ০১৭১৩৩৭৩৮৫৮\n\n ২৮। ওসি বাঘাতিপাড়া- ০১৭১৩৩৭৩৮৫৯\n\n ২৯। ওসি গুরুদাসপুর- ০১৭১৩৩৭৩৮৬০\n\n ৩০। ওসি লালপুর- ০১৭১৩৩৭৩৮৬১\n\n ৩১। ওসি বরইগ্রাম- ০১৭১৩৩৭৩৮৬২\n\n ৩২। ওসি নলডাংগা- ০১৭১৩৩৭৩৮৬৩");
		_contentlist("রংপুর বিভাগ ", "\n৩৩) ওসি কোতয়ালী, রংপুর-০১৭১৩৩৭৩৮৭৪\n\n ৩৪) ওসি গঙ্গাচুড়া- ০১৭১৩৩৭৩৮৭৫\n\n ৩৫) ওসি ভোদরগঞ্জ- ০১৭১৩৩৭৩৮৭৬\n\n ৩৬) ওসি তারাগঞ্জ- ০১৭১৩৩৭৩৮৭৭\n\n ৩৭) ওসি মিঠাপুকুর- ০১৭১৩৩৭৩৮৭৮\n\n ৩৮) ওসি পীরগাছা- ০১৭১৩৩৭৩৮৭৯\n\n ৩৯) ওসি কাউনিয়া- ০১৭১৩৩৭৩৮৮০\n\n ৪০) ওসি পীরগঞ্জ- ০১৭১৩৩৭৩৮৮১\n\n ৪১) ওসি গাইবান্ধা- ০১৭১৩৩৭৩৮৯২\n\n ৪২) ওসি সাদুল্লাপুর- ০১৭১৩৩৭৩৮৯৩\n\n ৪৩) ওসি সুন্দরগঞ্জ- ০১৭১৩৩৭৩৮৯৪\n\n ৪৫) ওসি পলাশবাড়ী- ০১৭১৩৩৭৩৮৯৫\n\n ৪৬) ওসি গোবিন্দগঞ্জ- ০১৭১৩৩৭৩৮৯৬\n\n ৪৭) ওসি সাতঘাটা- ০১৭১৩৩৭৩৮৯৭\n\n ৪৮) ওসি ফুলছড়ি- ০১৭১৩৩৭৩৮৯৮\n\n ৪৯) ওসি নিলফামারী- ০১৭১৩৩৭৩৯০৯\n\n ৫০) ওসি সৈয়দপুর- ০১৭১৩৩৭৩৯১০\n\n ৫১) ওসি জলঢাকা- ০১৭১৩৩৭৩৯১১\n\n ৫২) ওসি কিশোরগঞ্জ (নিলফামারী)-০১৭১৩৩৭৩৯১২\n\n ৫৩) ওসি ডোমার- ০১৭১৩৩৭৩৯১৩\n\n ৫৪) ওসি ডিমলা- ০১৭১৩৩৭৩৯১৪\n\n ৫৪) ওসি সৈয়দপুর পুলিশ ফাড়ী-০১৭১৩৩৭৩৯১৫\n\n ৫৫) ওসি কুড়িগ্রাম- ০১৭১৩৩৭৩৯২৬\n\n ৫৬) ওসি রাজারহাট- ০১৭১৩৩৭৩৯২৭\n\n ৫৭) ওসি ফুলবাড়ী- ০১৭১৩৩৭৩৯২৮\n\n ৫৮) ওসি নাগেশ্বর- ০১৭১৩৩৭৩৯২৯\n\n ৫৯) ওসি বুরুঙ্গামারী- ০১৭১৩৩৭৩৯৩০\n\n ৬০) ওসি উলিপুর- ০১৭১৩৩৭৩৯৩১\n\n ৬১) ওসি চিলমারী- ০১৭১৩৩৭৩৯৩২\n\n ৬২) ওসি রৌমারী- ০১৭১৩৩৭৩৯৩৩\n\n ৬৩) ওসি রাজীবপুর- ০১৭১৩৩৭৩৯৩৪\n\n ৬৪) ওসি দুসমারা- ০১৭১৩৩৭৩৯৩৫\n\n ৬৫) ওসি কোচাকাটা- ০১৭১৩৩৭৩৯৩৬\n\n ৬৬) ওসি লালমনিরহাট- ০১৭১৩৩৭৩৯৪৬\n\n ৬৭) ওসি আদিতমারি- ০১৭১৩৩৭৩৯৪৭\n\n ৬৮) ওসি কালিগঞ্জ- ০১৭১৩৩৭৩৯৪৮\n\n ৬৯) ওসি হাতিবান্দা- ০১৭১৩৩৭৩৯৪৯\n\n ৭০) ওসি পাটগ্রাম- ০১৭১৩৩৭৩৯৫০\n\n ৭১) ওসি কোতয়ালী দিনাজপুর-০১৭১৩৩৭৩৯৬৩\n\n ৭২) ওসি চিরির বন্দর- ০১৭১৩৩৭৩৯৬৪\n\n ৭৩) ওসি রিরল- ০১৭১৩৩৭৩৯৬৫\n\n ৭৪) ওসি পার্বতীপুর- ০১৭১৩৩৭৩৯৬৬\n\n ৭৫) ওসি বীরগঞ্জ- ০১৭১৩৩৭৩৯৬৭\n\n ৭৬) ওসি বোছাগঞ্জ- ০১৭১৩৩৭৩৯৬৮\n\n ৭৭) ওসি কাহারোল- ০১৭১৩৩৭৩৯৬৯\n\n ৭৮) ওসি খানসামা- ০১৭১৩৩৭৩৯৭০\n\n ৭৯) ওসি ফুলবাড়ী- ০১৭১৩৩৭৩৯৭১\n\n ৮০) ওসি বিরামপুর- ০১৭১৩৩৭৩৯৭২\n\n ৮২) ওসি নবাবগঞ্জ (দিনাজপুর)-০১৭১৩৩৭৩৯৭৩\n\n ৮৩) ওসি ঘোড়াঘাট- ০১৭১৩৩৭৩৯৭৪\n\n ৮৪) ওসি হাকিমপুর- ০১৭১৩৩৭৩৯৭৫\n\n ৮৫) ওসি ঠাকুরগাও- ০১৭১৩৩৭৩৯৮৫\n\n ৮৬) ওসি বালিয়াডাঙ্গী-০১৭১৩৩৭৩৯৮৬\n\n ৮৭) ওসি রানীসঙ্কৌল- ০১৭১৩৩৭৩৯৮৭\n\n ৮৮) ওসি পীরগঞ্জ- ০১৭১৩৩৭৩৯৮৮\n\n ৮৯) ওসি হরিপুর- ০১৭১৩৩৭৩৯৮৯\n\n ৯০) ওসি পঞ্চগড়- ০১৭১৩৩৭৩৯৯৯\n\n ৯১) ওসি বোদা- ০১৭১৩৩৭৪০০০\n\n ৯২) ওসি আটোয়ারী- ০১৭১৩৩৭৪০০১\n\n ৯৩) ওসি তেতুলিয়া- ০১৭১৩৩৭৪০০২\n\n ৯৪) ওসি দেবীগঞ্জ- ০১৭১৩৩৭৪০০৩\n\n ৯৫) ওসি পাবনা- ০১৭১৩৩৭৪০১৬\n\n ৯৬) ওসি ঈশ্বরদী- ০১৭১৩৩৭৪০১৭\n\n ৯৭) ওসি আটঘরিয়া- ০১৭১৩৩৭৪০১৮\n\n ৯৮) ওসি চাটমোহর- ০১৭১৩৩৭৪০১৯\n\n ৯৯) ওসি ভঙ্গোরা- ০১৭১৩৩৭৪০২০\n\n ১০০) ওসি ফরিদপুর (পাবনা)-০১৭১৩৩৭৪০২১\n\n ১০১) ওসি সূর্যনগর- ০১৭১৩৩৭৪০২২\n\n ১০২) ওসি বেড়া- ০১৭১৩৩৭৪০২৩\n\n ১০৩) ওসি সাথিয়া- ০১৭১৩৩৭৪০২৪\n\n ১০৪) ওসি আতাইকুলা- ০১৭১৩৩৭৪০২৫\n\n ১০৫) ওসি সিরাজগঞ্জ- ০১৭১৩৩৭৪০৩৮\n\n ১০৬) ওসি শাহাজাদপুর- ০১৭১৩৩৭৪০৩৯\n\n ১০৭) ওসি উল্লাপাড়া- ০১৭১৩৩৭৪০৪০\n\n ১০৮) ওসি চৌহালী- ০১৭১৩৩৭৪০৪১\n\n ১০৯) ওসি তারাস- ০১৭১৩৩৭৪০৪২\n\n ১১০) ওসি কাজিপুর- ০১৭১৩৩৭৪০৪৩\n\n ১১১) ওসি কামারকান্দা- ০১৭১৩৩৭৪০৪৪\n\n ১১২) ওসি রায়গঞ্জ- ০১৭১৩৩৭৪০৪৫\n\n ১১৩) ওসি বেলকুচি- ০১৭১৩৩৭৪০৪৬\n\n ১১৪) ওসি যমুনা ব্রীজ পশ্চিম-0১৭১৩৩৭৪০৪৭\n\n ১১৫) ওসি সালাঙ্গা- ০১৭১৩৩৭৪০৪৮\n\n ১১৬) ওসি এনায়েতপুর- ০১৭১৩৩৭৪০৪৯\n\n ১১৭) ওসি বগুড়া- ০১৭১৩৩৭৪০৬১\n\n ১১৮) ওসি শিবগঞ্জ- ০১৭১৩৩৭৪০৬২\n\n ১১৯) ওসি সোনাতলা- ০১৭১৩৩৭৪০৬৩\n\n ১২০) ওসি গাবতলী- ০১৭১৩৩৭৪০৬৪\n\n ১২১) ওসি সারিয়াকান্দি-০১৭১৩৩৭৪০৬৫\n\n ১২২) ওসি আদমদিঘী- ০১৭১৩৩৭৪০৬৬\n\n ১২৩) ওসি ধুপচাচিয়া- ০১৭১৩৩৭৪০৬৭\n\n ১২৪) ওসি কাহালু- ০১৭১৩৩৭৪০৬৮\n\n ১২৫) ওসি শেরপুর- ০১৭১৩৩৭৪০৬৯\n\n ১২৬) ওসি ধুনট- ০১৭১৩৩৭৪০৭০\n\n ১২৭) ওসি নন্দিগ্রাম- ০১৭১৩৩৭৪০৭১\n\n ১২৮) ওসি শাহজাহানপুর- ০১৭১৩৩৭৪০৭২\n\n ১২৯) ওসি জয়পুরহাট- ০১৭১৩৩৭৪০৮২\n\n ১৩০) ওসি কালাই- ০১৭১৩৩৭৪০৮৩\n\n ১৩১) ওসি ক্ষেতলাল- ০১৭১৩৩৭৪০৮৪\n\n ১৩২) ওসি আক্কেলপুর- ০১৭১৩৩৭৪০৮৫\n\n ১৩৩) ওসি পাচবিবি- ০১৭১৩৩৭৪০৮৬");
		_contentlist("খুলনা বিভাগ", "\n ১। ওসি ফুলতলা- ০১৭১৩৩৭৪১০৩\n\n ২। ওসি দিঘলিয়া- ০১৭১৩৩৭৪১০৪\n\n ৩। ওসি পাইকগাছা- ০১৭১৩৩৭৪১০৫\n\n ৪। ওসি বটিয়াঘাটা- ০১৭১৩৩৭৪১০৬\n\n ৫। ওসি ডুমুরিয়া- ০১৭১৩৩৭৪১০৭\n\n ৬। ওসি তেরখাদা- ০১৭১৩৩৭৪১০৮\n\n ৭। ওসি রুপসা- ০১৭১৩৩৭৪১০৯\n\n ৮। ওসি দাকোপ- ০১৭১৩৩৭৪১১০\n\n ৯। ওসি কয়রা- ০১৭১৩৩৭৪১১১\n\n ১০। ওসি বাগেরহাট- ০১৭১৩৩৭৪১২২\n\n ১১। ওসি ফকিরহাট- ০১৭১৩৩৭৪১২৩\n\n ১২। ওসি মোল্লারহাট- ০১৭১৩৩৭৪১২৪\n\n ১৩। ওসি চিতলমারী- ০১৭১৩৩৭৪১২৫\n\n ১৪। ওসি কচুয়া- ০১৭১৩৩৭৪১২৬\n\n ১৫। ওসি মোরলগঞ্জ- ০১৭১৩৩৭৪১২৭\n\n ১৬। ওসি শরনখোলা- ০১৭১৩৩৭৪১২৮\n\n ১৭। ওসি মংলা- ০১৭১৩৩৭৪১২৯\n\n ১৮। ওসি রামপাল- ০১৭১৩৩৭৪১৩০\n\n ১৯। ওসি সাতক্ষীরা- ০১৭১৩৩৭৪১৪১\n\n ২০। ওসি কলারোয়া- ০১৭১৩৩৭৪১৪২\n\n ২১। ওসি তালা- ০১৭১৩৩৭৪১৪৩\n\n ২২। ওসি কালিগঞ্জ- ০১৭১৩৩৭৪১৪৪\n\n ২৩। ওসি শ্যামনগর- ০১৭১৩৩৭৪১৪৫\n\n ২৪। ওসি দেবহাটা- ০১৭১৩৩৭৪১৪৬\n\n ২৫। ওসি আশাশুনি- ০১৭১৩৩৭৪১৪৭\n\n ২৬। ওসি পাটকেলঘাটা- ০১৭১৩৩৭৪১৪৮\n\n ২৭। ওসি কোতয়ালী যশোর- ০১৭১৩৩৭৪১৬১\n\n ২৮। ওসি ঝিকরগাছা- ০১৭১৩৩৭৪১৬২\n\n ২৯। ওসি শার্শা- ০১৭১৩৩৭৪১৬৩\n\n ৩০। ওসি চৌগাছা- ০১৭১৩৩৭৪১৬৪\n\n ৩১। ওসি মনিরামপুর- ০১৭১৩৩৭৪১৬৫\n\n ৩২। ওসি কেশবপুর- ০১৭১৩৩৭৪১৬৬\n\n ৩৩। ওসি অভয়নগর- ০১৭১৩৩৭৪১৬৭\n\n ৩৪। ওসি বাঘারপাড়া- ০১৭১৩৩৭৪১৬৮\n\n ৩৫। ওসি বেনাপোল পোর্ট- ০১৭১৩৩৭৪১৬৯\n\n ৩৬। ওসি বেনাপোল চেক পোষ্ট- ০১৭১৩৩৭৪১৭০\n\n ৩৭। ওসি মাগুরা- ০১৭১৩৩৭৪১৭৯\n\n ৩৮। ওসি শালিখা- ০১৭১৩৩৭৪১৮০\n\n ৩৯। ওসি শ্রীপুর- ০১৭১৩৩৭৪১৮১\n\n ৪০। ওসি মোহাম্মদপুর- ০১৭১৩৩৭৪১৮২\n\n ৪১। ওসি ঝিনাইদহ- ০১৭১৩৩৭৪১৯২\n\n ৪২। ওসি কালিগঞ্জ- ০১৭১৩৩৭৪১৯৩\n\n ৪৩। ওসি শৈলকুপা- ০১৭১৩৩৭৪১৯৪\n\n ৪৪। ওসি হরিনাকুন্ডু- ০১৭১৩৩৭৪১৯৫\n\n ৪৫। ওসি কোটচাদপুর- ০১৭১৩৩৭৪১৯৬\n\n ৪৬। ওসি মহেশপুর- ০১৭১৩৩৭৪১৯৭\n\n ৪৭। ওসি নড়াইল- ০১৭১৩৩৭৪২০৬\n\n ৪৮। ওসি কালিয়া- ০১৭১৩৩৭৪২০৭\n\n ৪৯। ওসি লোহাগড়া- ০১৭১৩৩৭৪২০৮\n\n ৫০। ওসি নড়াগাতি- ০১৭১৩৩৭৪২০৯\n\n ৫১। ওসি কুষ্টিয়া- ০১৭১৩৩৭৪২২০\n\n ৫২। ওসি খোকসা- ০১৭১৩৩৭৪২২১\n\n ৫৩। ওসি কুমারখালী- ০১৭১৩৩৭৪২২২\n\n ৫৪। ওসি ভেড়ামারা- ০১৭১৩৩৭৪২২৩\n\n ৫৫। ওসি দৌলতপুর- ০১৭১৩৩৭৪২২৪\n\n ৫৬। ওসি মিরপুর- ০১৭১৩৩৭৪২২৫\n\n ৫৭। ওসি ইসলামী ইউনিভার্সিটি- ০১৭১৩৩৭৪২২৬\n\n ৫৮। ওসি চুয়াডাংগা- ০১৭১৩৩৭৪২৩৬\n\n ৫৯। ওসি আলমডাংগা- ০১৭১৩৩৭৪২৩৭\n\n ৬০। ওসি জীবননগর- ০১৭১৩৩৭৪২৩৮\n\n ৬১। ওসি ডামুরহুদা- ০১৭১৩৩৭৪২৩৯\n\n ৬২। ওসি মেহেরপুর- ০১৭১৩৩৭৪২৪৯\n\n ৬৩। ওসি গাংনী- ০১৭১৩৩৭৪২৫০\n\n ৬৪। ওসি মুজিবনগর- ০১৭১৩৩৭৪২৫১");
		_contentlist("বরিশাল বিভাগ", "\n ১। ওসি কোতয়ালী বরিশাল- ০১৭১৩৩৭৪২৬৭\n\n ২। ওসি হিজলা- ০১৭১৩৩৭৪২৬৮\n\n ৩। ওসি মেহেদীগঞ্জ- ০১৭১৩৩৭৪২৬৯\n\n ৪। ওসি মুলাদী- ০১৭১৩৩৭৪২৭০\n\n ৫। ওসি বাবুগঞ্জ- ০১৭১৩৩৭৪২৭১\n\n ৬। ওসি বাকেরগঞ্জ- ০১৭১৩৩৭৪২৭২\n\n ৭। ওসি বানারীপাড়া- ০১৭১৩৩৭৪২৭৩\n\n ৮। ওসি আগৌলঝাড়া- ০১৭১৩৩৭৪২৭৪\n\n ৯। ওসি গৌরনদী- ০১৭১৩৩৭৪২৭৫\n\n ১০। ওসি উজিরপুর- ০১৭১৩৩৭৪২৭৬\n\n ১১। ওসি ঝালকাঠি- ০১৭১৩৩৭৪২৮৬\n\n ১২। ওসি নলছিঠি- ০১৭১৩৩৭৪২৮৭\n\n ১৩। ওসি রাজাপুর- ০১৭১৩৩৭৪২৮৮\n\n ১৪। ওসি কাঠালিয়া- ০১৭১৩৩৭৪২৮৯\n\n ১৫। ওসি ভোলা- ০১৭১৩৩৭৪৩০০\n\n ১৬। ওসি দৌলতখান- ০১৭১৩৩৭৪৩০১\n\n ১৭। ওসি তজুমুদ্দিন- ০১৭১৩৩৭৪৩০২\n\n ১৮। ওসি বোরহানউদ্দিন- ০১৭১৩৩৭৪৩০৩\n\n ১৯। ওসি লালমোহন- ০১৭১৩৩৭৪৩০৪\n\n ২০। ওসি চরফ্যাশন- ০১৭১৩৩৭৪৩০৫\n\n ২১। ওসি মনপুরা- ০১৭১৩৩৭৪৩০৬\n\n ২২। ওসি পটুয়াখালী- ০১৭১৩৩৭৪৩১৮\n\n ২৩। ওসি বাউফল- ০১৭১৩৩৭৪৩১৯\n\n ২৪। ওসি গলাচিপা- ০১৭১৩৩৭৪৩২০\n\n ২৫। ওসি দশমিনা- ০১৭১৩৩৭৪৩২১\n\n ২৬। ওসি দুমকী- ০১৭১৩৩৭৪৩২২\n\n ২৭। ওসি কলাপাড়া- ০১৭১৩৩৭৪৩২৩\n\n ২৮। ওসি মির্জাগঞ্জ- ০১৭১৩৩৭৪৩২৪\n\n ২৯। ওসি রাঙ্গাবালি- ০১৭১৩৩৭৪৩২৫\n\n ৩০। ওসি পিরোজপুর- ০১৭১৩৩৭৪৩৩৬\n\n ৩১। ওসি ভান্ডারিয়া- ০১৭১৩৩৭৪৩৩৭\n\n ৩২। ওসি নেসারাবাদ- ০১৭১৩৩৭৪৩৩৮\n\n ৩৩। ওসি কাউখালী- ০১৭১৩৩৭৪৩৩৯\n\n ৩৪। ওসি নাজিরপুর- ০১৭১৩৩৭৪৩৪০\n\n ৩৫। ওসি জিয়া নগর- ০১৭১৩৩৭৪৩৪১\n\n ৩৬। ওসি মঠবাড়ীয়া- ০১৭১৩৩৭৪৩৪২\n\n ৩৭। ওসি বরগুনা- ০১৭১৩৩৭৪৩৫৩\n\n ৩৮। ওসি আমতলী- ০১৭১৩৩৭৪৩৫৪\n\n ৩৯। ওসি পাথরঘাটা- ০১৭১৩৩৭৪৩৫৫\n\n ৪০। ওসি বেতাগী- ০১৭১৩৩৭৪৩৫৬\n\n ৪১। ওসি বামনা- ০১৭১৩৩৭৪৩৫৭\n\n ৪২। ওসি তালতলি- ০১৭১৩৩৭৪৩৫৮");
		_contentlist("সিলেট বিভাগ", "\n ১। ওসি কোতয়ালী (সিলেট)- ০১৭১৩৩৭৪৩৭৫\n\n ২। ওসি বালাগঞ্জ- ০১৭১৩৩৭৪৩৭৬\n\n ৩। ওসি জৈন্তাপুর- ০১৭১৩৩৭৪৩৭৭\n\n ৪। ওসি গোয়াইনঘাট- ০১৭১৩৩৭৪৩৭৮\n\n ৫। ওসি কানাইঘাট- ০১৭১৩৩৭৪৩৭৯\n\n ৬। ওসি কোম্পানীগঞ্জ- ০১৭১৩৩৭৪৩৮০\n\n ৭। ওসি জকিগঞ্জ- ০১৭১৩৩৭৪৩৮১\n\n ৮। ওসি বিয়ানীবাজার- ০১৭১৩৩৭৪৩৮২\n\n ৯। ওসি গোলাপগঞ্জ- ০১৭১৩৩৭৪৩৮৩\n\n ১০। ওসি বিশ্বনাথ- ০১৭১৩৩৭৪৩৮৪\n\n ১১। ওসি ফেঞ্চুগঞ্জ- ০১৭১৩৩৭৪৩৮৫\n\n ১২। ওসি দক্ষিন সুরমা- ০১৭১৩৩৭৪৩৮৬\n\n ১৩। ওসি ওসমানী নগর- ০১৭১৩৩৭৪৩৮৭\n\n ১৪। ওসি হবিগঞ্জ- ০১৭১৩৩৭৪৩৯৮\n\n ১৫। ওসি মাধবপুর- ০১৭১৩৩৭৪৩৯৯\n\n ১৬। ওসি চুনারুঘাট- ০১৭১৩৩৭৪৪০০\n\n ১৭। ওসি বাহুবল- ০১৭১৩৩৭৪৪০১\n\n ১৮। ওসি লাখাই- ০১৭১৩৩৭৪৪০২\n\n ১৯। ওসি নবীগঞ্জ- ০১৭১৩৩৭৪৪০৩\n\n ২০। ওসি বানিয়াচং- ০১৭১৩৩৭৪৪০৪\n\n ২১। ওসি আজমিরিগঞ্জ- ০১৭১৩৩৭৪৪০৫\n\n ২২। ওসি শায়েস্তাগঞ্জ- ০১৭১৩৩৭৪৪০৬\n\n ২৩। ওসি সুনামগঞ্জ- ০১৭১৩৩৭৪৪১৮\n\n ২৪। ওসি ছাতক- ০১৭১৩৩৭৪৪১৯\n\n ২৫। ওসি জগন্নাথপুর- ০১৭১৩৩৭৪৪২০\n\n ২৬। ওসি তাহিরপুর- ০১৭১৩৩৭৪৪২১\n\n ২৭। ওসি বিশ্বম্বরপুর- ০১৭১৩৩৭৪৪২২\n\n ২৮। ওসি দোয়ারাবাজার- ০১৭১৩৩৭৪৪২৩\n\n ২৯। ওসি দিরাই- ০১৭১৩৩৭৪৪২৪\n\n ৩০। ওসি সালনা- ০১৭১৩৩৭৪৪২৫\n\n ৩১। ওসি জামালগঞ্জ- ০১৭১৩৩৭৪৪২৬\n\n ৩২। ওসি ধর্মপাশা- ০১৭১৩৩৭৪৪২৭\n\n ৩৩। ওসি মধ্যনগর- ০১৭১৩৩৭৪৪২৮\n\n ৩৪। ওসি মৌলভীবাজার- ০১৭১৩৩৭৪৪৩৯\n\n ৩৫। ওসি শ্রীমঙ্গল- ০১৭১৩৩৭৪৪৪০\n\n ৩৬। ওসি কমলগঞ্জ- ০১৭১৩৩৭৪৪৪১\n\n ৩৭। ওসি রাজনগর- ০১৭১৩৩৭৪৪৪২\n\n ৩৮। ওসি কুলাউড়া- ০১৭১৩৩৭৪৪৪৩\n\n ৩৯। ওসি বড়লেখা- ০১৭১৩৩৭৪৪৪৪\n\n ৪০। ওসি জুরি- ০১৭১৩৩৭৪৪৪৫");
	}
	
	@Override
	public void onBackPressed() {
		finish();
	}
	public void _statusbarcolor(final String _color) {
		try {
			if(Build.VERSION.SDK_INT >= 21) {
				Window w = this.getWindow();
				w.clearFlags(WindowManager.LayoutParams.FLAG_TRANSLUCENT_STATUS);
				w.addFlags(WindowManager.LayoutParams.FLAG_DRAWS_SYSTEM_BAR_BACKGROUNDS);
				w.setStatusBarColor(Color.parseColor(_color));
			}
		} catch (Exception e) {}
	}
	
	
	public void _contentlist(final String _add, final String _add1) {
		map = new HashMap<>();
		map.put("1", _add);
		map.put("2", _add1);
		list.add(map);
		listview1.setAdapter(new Listview1Adapter(list));
		((BaseAdapter)listview1.getAdapter()).notifyDataSetChanged();
	}
	
	
	public void _stock(final View _m) {
		{
			android.graphics.drawable.GradientDrawable SketchUi = new android.graphics.drawable.GradientDrawable();
			int d = (int) getApplicationContext().getResources().getDisplayMetrics().density;
			SketchUi.setColor(0xFFFFFFFF);
			_m.setElevation(d*5);
			android.graphics.drawable.RippleDrawable SketchUi_RD = new android.graphics.drawable.RippleDrawable(new android.content.res.ColorStateList(new int[][]{new int[]{}}, new int[]{0xFFB3E5FC}), SketchUi, null);
			_m.setBackground(SketchUi_RD);
		}
	}
	
	public class Listview1Adapter extends BaseAdapter {
		
		ArrayList<HashMap<String, Object>> _data;
		
		public Listview1Adapter(ArrayList<HashMap<String, Object>> _arr) {
			_data = _arr;
		}
		
		@Override
		public int getCount() {
			return _data.size();
		}
		
		@Override
		public HashMap<String, Object> getItem(int _index) {
			return _data.get(_index);
		}
		
		@Override
		public long getItemId(int _index) {
			return _index;
		}
		
		@Override
		public View getView(final int _position, View _v, ViewGroup _container) {
			LayoutInflater _inflater = getLayoutInflater();
			View _view = _v;
			if (_view == null) {
				_view = _inflater.inflate(R.layout.policephone, null);
			}
			
			final LinearLayout linear1 = _view.findViewById(R.id.linear1);
			final TextView textview1 = _view.findViewById(R.id.textview1);
			final LinearLayout linear2 = _view.findViewById(R.id.linear2);
			final ImageView imageview1 = _view.findViewById(R.id.imageview1);
			
			_stock(linear1);
			android.view.animation.Animation animation = new android.view.animation.ScaleAnimation(0f, 1f, 0f, 1f, android.view.animation.Animation.RELATIVE_TO_SELF, 0f, android.view.animation.Animation.RELATIVE_TO_SELF, 1f);
			animation.setFillAfter(true);
			animation.setDuration(300);
			linear1.setAnimation(animation);
			textview1.setTypeface(Typeface.createFromAsset(getAssets(),"fonts/solaimanlipi.ttf"), 0);
			textview1.setText(list.get((int)_position).get("1").toString());
			linear1.setOnClickListener(new View.OnClickListener() {
				@Override
				public void onClick(View _view) {
					in.setClass(getApplicationContext(), PhonenumberActivity.class);
					in.putExtra("1", list.get((int)_position).get("1").toString());
					in.putExtra("2", list.get((int)_position).get("2").toString());
					startActivity(in);
				}
			});
			
			return _view;
		}
	}
	
	@Deprecated
	public void showMessage(String _s) {
		Toast.makeText(getApplicationContext(), _s, Toast.LENGTH_SHORT).show();
	}
	
	@Deprecated
	public int getLocationX(View _v) {
		int _location[] = new int[2];
		_v.getLocationInWindow(_location);
		return _location[0];
	}
	
	@Deprecated
	public int getLocationY(View _v) {
		int _location[] = new int[2];
		_v.getLocationInWindow(_location);
		return _location[1];
	}
	
	@Deprecated
	public int getRandom(int _min, int _max) {
		Random random = new Random();
		return random.nextInt(_max - _min + 1) + _min;
	}
	
	@Deprecated
	public ArrayList<Double> getCheckedItemPositionsToArray(ListView _list) {
		ArrayList<Double> _result = new ArrayList<Double>();
		SparseBooleanArray _arr = _list.getCheckedItemPositions();
		for (int _iIdx = 0; _iIdx < _arr.size(); _iIdx++) {
			if (_arr.valueAt(_iIdx))
			_result.add((double)_arr.keyAt(_iIdx));
		}
		return _result;
	}
	
	@Deprecated
	public float getDip(int _input) {
		return TypedValue.applyDimension(TypedValue.COMPLEX_UNIT_DIP, _input, getResources().getDisplayMetrics());
	}
	
	@Deprecated
	public int getDisplayWidthPixels() {
		return getResources().getDisplayMetrics().widthPixels;
	}
	
	@Deprecated
	public int getDisplayHeightPixels() {
		return getResources().getDisplayMetrics().heightPixels;
	}
}
